src/main/java/ru/vk/itmo/test/tveritinalexandr/reports/step_1/wrk2/get_wrk2_output
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm % ./wrk -d 20 -t 1 -c 1 -R 2300 -L -s /Users/tveritinaleksandr/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/tveritinalexandr/lua/get_request.lua http://localhost:8080

Running 20s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 49.307ms, rate sampling interval: 182ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   171.94ms   46.76ms 255.49ms   61.39%
    Req/Sec     2.28k   126.55     2.85k    85.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  187.39ms
 75.000%  206.34ms
 90.000%  225.41ms
 99.000%  253.44ms
 99.900%  254.97ms
 99.990%  255.49ms
 99.999%  255.62ms
100.000%  255.62ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      84.031     0.000000            2         1.00
     104.383     0.100000         2281         1.11
     117.631     0.200000         4560         1.25
     139.647     0.300000         6832         1.43
     165.375     0.400000         9094         1.67
     187.391     0.500000        11365         2.00
     194.175     0.550000        12507         2.22
     197.759     0.600000        13643         2.50
     201.471     0.650000        14774         2.86
     203.519     0.700000        15922         3.33
     206.335     0.750000        17102         4.00
     207.359     0.775000        17614         4.44
     209.151     0.800000        18185         5.00
     212.223     0.825000        18746         5.71
     215.039     0.850000        19323         6.67
     219.007     0.875000        19896         8.00
     222.719     0.887500        20167         8.89
     225.407     0.900000        20472        10.00
     227.327     0.912500        20735        11.43
     232.063     0.925000        21022        13.33
     235.903     0.937500        21310        16.00
     238.335     0.943750        21448        17.78
     242.047     0.950000        21586        20.00
     244.223     0.956250        21735        22.86
     247.935     0.962500        21872        26.67
     249.727     0.968750        22023        32.00
     250.367     0.971875        22096        35.56
     250.751     0.975000        22154        40.00
     251.135     0.978125        22226        45.71
     251.647     0.981250        22308        53.33
     252.287     0.984375        22382        64.00
     252.543     0.985938        22415        71.11
     252.799     0.987500        22439        80.00
     253.311     0.989062        22493        91.43
     253.439     0.990625        22512       106.67
     253.695     0.992188        22555       128.00
     253.823     0.992969        22577       142.22
     253.951     0.993750        22594       160.00
     254.079     0.994531        22607       182.86
     254.207     0.995313        22625       213.33
     254.335     0.996094        22636       256.00
     254.463     0.996484        22653       284.44
     254.463     0.996875        22653       320.00
     254.591     0.997266        22667       365.71
     254.719     0.997656        22685       426.67
     254.719     0.998047        22685       512.00
     254.719     0.998242        22685       568.89
     254.847     0.998437        22693       640.00
     254.847     0.998633        22693       731.43
     254.975     0.998828        22700       853.33
     254.975     0.999023        22700      1024.00
     255.103     0.999121        22710      1137.78
     255.103     0.999219        22710      1280.00
     255.103     0.999316        22710      1462.86
     255.103     0.999414        22710      1706.67
     255.231     0.999512        22715      2048.00
     255.231     0.999561        22715      2275.56
     255.231     0.999609        22715      2560.00
     255.231     0.999658        22715      2925.71
     255.359     0.999707        22719      3413.33
     255.359     0.999756        22719      4096.00
     255.359     0.999780        22719      4551.11
     255.359     0.999805        22719      5120.00
     255.359     0.999829        22719      5851.43
     255.359     0.999854        22719      6826.67
     255.487     0.999878        22721      8192.00
     255.487     0.999890        22721      9102.22
     255.487     0.999902        22721     10240.00
     255.487     0.999915        22721     11702.86
     255.487     0.999927        22721     13653.33
     255.487     0.999939        22721     16384.00
     255.487     0.999945        22721     18204.44
     255.487     0.999951        22721     20480.00
     255.615     0.999957        22722     23405.71
     255.615     1.000000        22722          inf
#[Mean    =      171.942, StdDeviation   =       46.756]
#[Max     =      255.488, Total count    =        22722]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45505 requests in 20.00s, 4.09MB read
  Non-2xx or 3xx responses: 24284
Requests/sec:   2275.24
Transfer/sec:    209.22KB
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm %