src/main/java/ru/vk/itmo/test/tveritinalexandr/reports/step_1/wrk2/put_wrk2_output
tveritinaleksandr@Tveritins-MacBook-Pro wrk2-arm % ./wrk -d 20 -t 1 -c 1 -R 30000 -L -s /Users/tveritinaleksandr/IdeaProjects/2024-highload-dht/src/main/java/ru/vk/itmo/test/tveritinalexandr/lua/put_rquest.lua http://localhost:8080

Running 20s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 91.757ms, rate sampling interval: 319ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.26ms   12.47ms  43.30ms   74.70%
    Req/Sec    30.16k   510.15    31.32k    64.52%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.83ms
 75.000%   24.35ms
 90.000%   30.02ms
 99.000%   42.21ms
 99.900%   43.13ms
 99.990%   43.30ms
 99.999%   43.33ms
100.000%   43.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.023     0.000000            1         1.00
       0.943     0.100000        30091         1.11
       1.787     0.200000        60180         1.25
       2.589     0.300000        90265         1.43
       3.407     0.400000       120344         1.67
       4.827     0.500000       150413         2.00
       6.267     0.550000       165453         2.22
       7.683     0.600000       180493         2.50
       8.983     0.650000       195583         2.86
      11.455     0.700000       210585         3.33
      24.351     0.750000       225667         4.00
      25.279     0.775000       233238         4.44
      25.951     0.800000       240656         5.00
      27.119     0.825000       248266         5.71
      28.239     0.850000       255778         6.67
      29.023     0.875000       263231         8.00
      29.551     0.887500       267021         8.89
      30.015     0.900000       270750        10.00
      30.927     0.912500       274555        11.43
      31.455     0.925000       278266        13.33
      35.711     0.937500       282049        16.00
      38.399     0.943750       283938        17.78
      39.711     0.950000       285896        20.00
      39.967     0.956250       287691        22.86
      40.799     0.962500       289634        26.67
      41.279     0.968750       291455        32.00
      41.439     0.971875       292527        35.56
      41.567     0.975000       293515        40.00
      41.695     0.978125       294392        45.71
      41.887     0.981250       295265        53.33
      42.015     0.984375       296168        64.00
      42.079     0.985938       296767        71.11
      42.143     0.987500       297237        80.00
      42.175     0.989062       297552        91.43
      42.239     0.990625       298060       106.67
      42.303     0.992188       298514       128.00
      42.463     0.992969       298726       142.22
      42.559     0.993750       299033       160.00
      42.655     0.994531       299229       182.86
      42.783     0.995313       299478       213.33
      42.847     0.996094       299667       256.00
      42.943     0.996484       299811       284.44
      42.975     0.996875       299902       320.00
      43.039     0.997266       300179       365.71
      43.039     0.997656       300179       426.67
      43.071     0.998047       300296       512.00
      43.071     0.998242       300296       568.89
      43.103     0.998437       300430       640.00
      43.103     0.998633       300430       731.43
      43.135     0.998828       300534       853.33
      43.135     0.999023       300534      1024.00
      43.167     0.999121       300642      1137.78
      43.167     0.999219       300642      1280.00
      43.167     0.999316       300642      1462.86
      43.199     0.999414       300733      1706.67
      43.199     0.999512       300733      2048.00
      43.199     0.999561       300733      2275.56
      43.199     0.999609       300733      2560.00
      43.199     0.999658       300733      2925.71
      43.199     0.999707       300733      3413.33
      43.263     0.999756       300787      4096.00
      43.263     0.999780       300787      4551.11
      43.263     0.999805       300787      5120.00
      43.263     0.999829       300787      5851.43
      43.263     0.999854       300787      6826.67
      43.263     0.999878       300787      8192.00
      43.263     0.999890       300787      9102.22
      43.295     0.999902       300805     10240.00
      43.295     0.999915       300805     11702.86
      43.295     0.999927       300805     13653.33
      43.295     0.999939       300805     16384.00
      43.295     0.999945       300805     18204.44
      43.295     0.999951       300805     20480.00
      43.327     0.999957       300819     23405.71
      43.327     1.000000       300819          inf
#[Mean    =       11.255, StdDeviation   =       12.472]
#[Max     =       43.296, Total count    =       300819]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  599832 requests in 20.00s, 38.33MB read
Requests/sec:  29992.17
Transfer/sec:      1.92MB